fio_disk/disk_xfs/log/log_37/sdf/fio_randread_04k.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=23384: Sun Jul 15 03:50:37 2018
   read: IOPS=509, BW=2039KiB/s (2088kB/s)(1024MiB/514227msec)
    slat (nsec): min=1388, max=887078, avg=14733.30, stdev=6955.52
    clat (usec): min=571, max=1090.3k, avg=125523.43, stdev=92870.18
     lat (usec): min=577, max=1090.3k, avg=125538.58, stdev=92870.33
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   26], 10.00th=[   37], 20.00th=[   56],
     | 30.00th=[   72], 40.00th=[   88], 50.00th=[  105], 60.00th=[  122],
     | 70.00th=[  142], 80.00th=[  178], 90.00th=[  241], 95.00th=[  309],
     | 99.00th=[  464], 99.50th=[  535], 99.90th=[  709], 99.95th=[  776],
     | 99.99th=[  961]
   bw (  KiB/s): min=  849, max= 7144, per=99.85%, avg=2036.03, stdev=403.14, samples=1028
   iops        : min=  212, max= 1786, avg=509.00, stdev=100.79, samples=1028
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.07%, 10=0.49%, 20=2.35%, 50=13.82%
  lat (msec)   : 100=30.86%, 250=43.42%, 500=8.28%, 750=0.65%, 1000=0.06%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.65%, sys=1.58%, ctx=257844, majf=0, minf=95
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2039KiB/s (2088kB/s), 2039KiB/s-2039KiB/s (2088kB/s-2088kB/s), io=1024MiB (1074MB), run=514227-514227msec

Disk stats (read/write):
  sdf: ios=259254/6, merge=2659/0, ticks=32708215/3715, in_queue=32713075, util=100.00%